api/app/controllers/items_controller.rb

  def list
    @items = Item.all
---
SELECT `items`.* FROM `items`

  def create
    @item = Item.new(item_params)

    respond_to do |format|
      if @item.save
---
INSERT INTO `items` (`created_at`, `importante`, `produto`, `quantidade`, `updated_at`) VALUES ('2014-12-17 16:35:50', 1, 'jklç', '4', '2014-12-17 16:35:50')

  def update
    respond_to do |format|
      if @item.update(item_params)
---
UPDATE `items` SET `importante` = 0, `produto` = 'fgerteg', `quantidade` = '454545', `updated_at` = '2014-12-18 13:12:19' WHERE `items`.`id` = 56

  def destroy
    @item.destroy
---
DELETE FROM `items` WHERE `items`.`id` = 65